import React from 'react';
import { SloganSection } from './components/slogan/SloganSection';
import { LoadableContent } from '@/components/common/loadable-content/LoadableContent';
import { ReviewsSection } from './components/reviews/ReviewsSection';
import { ReviewArticlesSection } from './components/review-articles/ReviewArticlesSection';
import { VideoReviewsSection } from './components/video-reviews/VideoReviewsSection';
import {
    StoriesOfVictoryReview,
    StoriesOfVictoryReviewArticle,
    StoriesOfVictoryReviewVideo,
} from '@/types/public/stories-of-victory';
import girlHugHorse from '@/assets/images/girl-hug-horse.webp';

interface StoriesOfVictoryPageProps {
    // Add props here as needed
}

const reviews: StoriesOfVictoryReview[] = [
    { id: 1, name: 'John Doe', review: 'Це був мій перший спокійний сон за багато місяців.' },
    { id: 2, name: 'John Doe', review: 'Я не думав, що кінь може змінити моє ставлення до життя.' },
    { id: 3, name: 'John Doe', review: 'Це був мій перший спокійний сон за багато місяців.' },
    { id: 4, name: 'John Doe', review: 'Я не думав, що кінь може змінити моє ставлення до життя.' },
    { id: 5, name: 'John Doe', review: 'Я не думав, що кінь може змінити моє ставлення до життя.' },
    { id: 6, name: 'John Doe', review: 'Я не думав, що кінь може змінити моє ставлення до життя.' },
];

const reviewArticles: StoriesOfVictoryReviewArticle[] = [
    {
        id: 1,
        title: 'Як коні допомагають дітям і ветеранам',
        text: [
            'Привіт! Я — Інга, морський піхотинець, оборонець міста Маріуполь, була у ворожому полоні пів року. Моє життя завжди було сповнене викликів, але один з найважливіших я пережила не на полі бою, а на кінній стежці.',
            'Коли я вперше потрапила на ранчо “Іго-го” у Вікторії під час заходу Victory Center, я стримувалася. Коні завжди здавалися мені величними, але водночас страшними тваринами. Я боялася їх ще з дитинства. Проте щось всередині підказувало мені, що цей страх можна подолати.',
            'Перша зустріч була незвичайною. Я підійшла до кобили на ім’я Кльопа і тихо зізналася їй: “Мені дуже важко на душі”. Але Кльопа просто розвернулася і пішла геть. Це було несподівано, навіть трішки боляче. Пізніше, стоячи у вольєрі, я розмовляла з Вікторією, і раптом Кльопа підійшла до мене, схилила голову. Це було наче знак: вона розуміла мене.',
            'Наступного разу я вирушила на десятикілометрову кінну стежку, організовані спілкою @ueatara. Вікторія запитала: “На кому ти хочеш поїхати — на Мені чи на Пегасі?” Пегасі був справжньою уособленою силою, і я дуже боялася його. Але щось всередині мене сказало: “Спробуй!”',
            'Я обрала Пегаса. Коли ми вирушили, я відчувала його міць і силу, які просто не передати словами. Це було неймовірно — така енергія, така гармонія! Пройти ці десять кілометрів верхи для мене стало справжнім досягненням, яке наповнило мене емоціями і гордістю.',
            'Після стежки ми зробили багато фото і відео. Деякими я поділюся з вами, щоб ви теж могли відчути цей зв’язок з кіньми, з природою, із собою.',
            'Ці моменти залишаються зі мною, як нагадування про те, що навіть у найтемніші часи можна знайти сили й подолати свої страхи.',
        ],
        image: girlHugHorse,
    },
    {
        id: 2,
        title: 'Як коні допомагають дітям і ветеранам',
        text: [
            'Привіт! Я — Інга, морський піхотинець, оборонець міста Маріуполь, була у ворожому полоні пів року. Моє життя завжди було сповнене викликів, але один з найважливіших я пережила не на полі бою, а на кінній стежці.',
            'Коли я вперше потрапила на ранчо “Іго-го” у Вікторії під час заходу Victory Center, я стримувалася. Коні завжди здавалися мені величними, але водночас страшними тваринами. Я боялася їх ще з дитинства. Проте щось всередині підказувало мені, що цей страх можна подолати.',
            'Перша зустріч була незвичайною. Я підійшла до кобили на ім’я Кльопа і тихо зізналася їй: “Мені дуже важко на душі”. Але Кльопа просто розвернулася і пішла геть. Це було несподівано, навіть трішки боляче. Пізніше, стоячи у вольєрі, я розмовляла з Вікторією, і раптом Кльопа підійшла до мене, схилила голову. Це було наче знак: вона розуміла мене.',
            'Наступного разу я вирушила на десятикілометрову кінну стежку, організовані спілкою @ueatara. Вікторія запитала: “На кому ти хочеш поїхати — на Мені чи на Пегасі?” Пегасі був справжньою уособленою силою, і я дуже боялася його. Але щось всередині мене сказало: “Спробуй!”',
            'Я обрала Пегаса. Коли ми вирушили, я відчувала його міць і силу, які просто не передати словами. Це було неймовірно — така енергія, така гармонія! Пройти ці десять кілометрів верхи для мене стало справжнім досягненням, яке наповнило мене емоціями і гордістю.',
            'Після стежки ми зробили багато фото і відео. Деякими я поділюся з вами, щоб ви теж могли відчути цей зв’язок з кіньми, з природою, із собою.',
            'Ці моменти залишаються зі мною, як нагадування про те, що навіть у найтемніші часи можна знайти сили й подолати свої страхи.',
        ],
        image: girlHugHorse,
    },
    {
        id: 3,
        title: 'Як коні допомагають дітям і ветеранам',
        text: [
            'Привіт! Я — Інга, морський піхотинець, оборонець міста Маріуполь, була у ворожому полоні пів року. Моє життя завжди було сповнене викликів, але один з найважливіших я пережила не на полі бою, а на кінній стежці.',
            'Коли я вперше потрапила на ранчо “Іго-го” у Вікторії під час заходу Victory Center, я стримувалася. Коні завжди здавалися мені величними, але водночас страшними тваринами. Я боялася їх ще з дитинства. Проте щось всередині підказувало мені, що цей страх можна подолати.',
            'Перша зустріч була незвичайною. Я підійшла до кобили на ім’я Кльопа і тихо зізналася їй: “Мені дуже важко на душі”. Але Кльопа просто розвернулася і пішла геть. Це було несподівано, навіть трішки боляче. Пізніше, стоячи у вольєрі, я розмовляла з Вікторією, і раптом Кльопа підійшла до мене, схилила голову. Це було наче знак: вона розуміла мене.',
            'Наступного разу я вирушила на десятикілометрову кінну стежку, організовані спілкою @ueatara. Вікторія запитала: “На кому ти хочеш поїхати — на Мені чи на Пегасі?” Пегасі був справжньою уособленою силою, і я дуже боялася його. Але щось всередині мене сказало: “Спробуй!”',
            'Я обрала Пегаса. Коли ми вирушили, я відчувала його міць і силу, які просто не передати словами. Це було неймовірно — така енергія, така гармонія! Пройти ці десять кілометрів верхи для мене стало справжнім досягненням, яке наповнило мене емоціями і гордістю.',
            'Після стежки ми зробили багато фото і відео. Деякими я поділюся з вами, щоб ви теж могли відчути цей зв’язок з кіньми, з природою, із собою.',
            'Ці моменти залишаються зі мною, як нагадування про те, що навіть у найтемніші часи можна знайти сили й подолати свої страхи.',
        ],
        image: girlHugHorse,
    },
];

const reviewVideos: StoriesOfVictoryReviewVideo[] = [
    { id: 1, title: 'Коні лікують 2025', link: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ' },
    { id: 2, title: 'Коні лікують 2025', link: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ' },
    { id: 3, title: 'Коні лікують 2025', link: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ' },
    { id: 4, title: 'Коні лікують 2025', link: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ' },
    { id: 5, title: 'Коні лікують 2025', link: 'https://www.youtube.com/watch?v=dQw4w9WgXcQ' },
];

export const StoriesOfVictoryPage: React.FC<StoriesOfVictoryPageProps> = () => {
    return (
        <LoadableContent isLoading={false} error={false}>
            {
                <>
                    <SloganSection />
                    <ReviewArticlesSection content={reviewArticles} />
                    <VideoReviewsSection content={reviewVideos} />
                    <ReviewsSection content={reviews} />
                </>
            }
        </LoadableContent>
    );
};
