import { EventsNewsPageData, EventsNews } from '@/types/public/events-news';
import chooseProgrammImg from '@/assets/images/horse-and-girl.webp';
import girlAndWhiteHorse from '@/assets/images/girl-and-white-horse.webp';
import oldManHorse from '@/assets/images/old-man-horse.webp';
import supportChildren from '@/assets/images/support-children.webp';
import peopleCircle from '@/assets/images/people-circle.webp';
import team from '@/assets/images/team.webp';
import hutirka from '@/assets/images/hutirka.webp';

export const eventsNewsPageMock: EventsNewsPageData = {
    description:
        'Цей розділ — про ті моменти, коли те, у що ми віримо, стає реальністю. Тут ти знайдеш все: від маленьких зустрічей до великих відкриттів, від перших кроків дітей у стайні до глибоких переживань ветеранів у сідлі.',
    chooseProgram: {
        title: 'Вір у силу події',
        description:
            'Кожна з них — не просто дата в календарі. Це — ще один доказ: відновлення можливе. Слідкуй за анонсами, читай історії, або стань частиною наступної події.',
        imgURL: chooseProgrammImg,
    },
    eventsData: {
        title: 'Що відбувалось',
        tags: [
            { id: '1', name: 'Новини' },
            { id: '2', name: 'Медіа' },
            { id: '3', name: 'Програми' },
        ],
    },
};

const tags = [
    {
        id: '1',
        name: 'Новини',
    },
    {
        id: '2',
        name: 'Медіа',
    },
    {
        id: '3',
        name: 'Програми',
    },
];

export const eventsNewsMock: EventsNews[] = [
    {
        id: '1',
        title: 'Центр психоемоційної підтримки Victory Center реалізує програму іповенції — подробиці',
        description:
            'На NV.ua вийшов великий матеріал про нашу роботу з ветеранами й дітьми. Журналісти побували на сесіях і побачили, як відбувається зцілення через довіру, тишу й спільність.',
        date: '16/02/2025',
        tags: [tags[1]],
        resource: 'Канал Дім',
        imageURL: girlAndWhiteHorse,
    },
    {
        id: '2',
        title: 'Як коні допомагають дітям і ветеранам',
        description:
            'На NV.ua вийшов великий матеріал про нашу роботу з ветеранами й дітьми. Журналісти побували на сесіях і побачили, як відбувається зцілення через довіру, тишу й спільність.',
        date: '16/02/2025',
        tags: [tags[2]],
        resource: 'NV',
        imageURL: supportChildren,
    },
    {
        id: '3',
        title: 'Терапевтична роль коней у реабілітації дітей і військових',
        description:
            'Журналісти дізналися подробиці про нашу програму з дітьми та вояками. Вони були свідками того, як довіра до коня становить ключовим елементом у процесі зцілення.',
        date: '16/02/2025',
        tags: [tags[0]],
        imageURL: peopleCircle,
    },
    {
        id: '4',
        title: 'Історії одужання: як коні змінюють життя ветеранів',
        description:
            "На порталі NV.ua опубліковано масштабний матеріал про наші програми з військовослужбовцями та дітьми. Інтерв'юеровані респонденти розповідали про зцілення через спілкування з конем.",
        date: '16/02/2025',
        tags: [tags[1]],
        resource: 'NV',
        imageURL: oldManHorse,
    },
    {
        id: '5',
        title: '«Коні — це тварини, які лікують без слів». Як проходять реабілітаційні заняття на ранчо під Києвом — репортаж NV',
        description:
            'Репортери побували на сесіях іпотерапії та переконалися в унікальності методу. Атмосфера довіри й спокою, які коні створюють навколо себе, стають фундаментом для відновлення.',
        date: '16/02/2025',
        tags: [tags[1]],
        resource: 'NV Live',
        imageURL: team,
    },
    {
        id: '6',
        title: 'Гутірка #2 Настя Попандопулос',
        description:
            'Розмова про те, як конярство впливає на психоемоційний стан учасників програми. Настя поділилася своїм досвідом взаємодії з конями на наших заняттях.',
        date: '16/02/2025',
        tags: [tags[1]],
        resource: 'Андрій Шимановський',
        imageURL: hutirka,
    },
    {
        id: '7',
        title: 'Центр психоемоційної підтримки Victory Center розповідає про нові програми іповенції',
        description:
            'Детальна розповідь про структуру та методи наших інноваційних програм. Спеціалісти центру пояснюють, чому іпотерапія виявляється настільки ефективною для всіх вікових груп.',
        date: '15/02/2025',
        tags: [tags[1]],
        resource: 'Канал Дім',
        imageURL: girlAndWhiteHorse,
    },
    {
        id: '8',
        title: 'Сила людино-тваринної взаємодії: конярство як шлях до одужання',
        description:
            'Аналіз наукових даних та реальних прикладів того, як взаємодія з конем допомагає подолати психологічні травми. Матеріал охоплює досвід роботи з різними віковими категоріями учасників.',
        date: '15/02/2025',
        tags: [tags[2]],
        resource: 'NV',
        imageURL: supportChildren,
    },
    {
        id: '9',
        title: 'Як коні підтримують дітей і ветеранів. :)',
        description:
            'NV.ua опублікував великий репортаж про нашу роботу з дітьми та ветеранами. Журналісти побували на заходах і відчули, як відбувається відновлення через довіру, тишу і спільне переживання.',
        date: '15/02/2025',
        tags: [tags[0]],
        imageURL: peopleCircle,
    },
    {
        id: '10',
        title: 'Трансформація через контакт: історії учасників нашої програми',
        description:
            'Інтимний погляд на те, як заняття з конями змінюють внутрішній світ дітей та військовослужбовців. Рідкісні моменти відкритого спілкування про те, що важко передати словами.',
        date: '15/02/2025',
        tags: [tags[1]],
        resource: 'NV',
        imageURL: oldManHorse,
    },
    {
        id: '11',
        title: '«Коні — це тварини, які лікують без слів». Як проходять реабілітаційні заняття на ранчо під Києвом — репортаж NV. :)',
        description:
            'NV.ua опублікував великий репортаж про нашу роботу з дітьми та ветеранами. Журналісти побували на заходах і відчули, як відбувається відновлення через довіру, тишу і спільне переживання. :)',
        date: '15/02/2025',
        tags: [tags[1]],
        resource: 'NV Live',
        imageURL: team,
    },
    {
        id: '12',
        title: 'Гутірка #2 Оксана Грушка',
        description:
            'Розмова з експертом про психологічні аспекти іпотерапії. Оксана поділяється знаннями про те, як розвивається довіра між людиною та конем.',
        date: '15/02/2025',
        tags: [tags[1]],
        resource: 'Оксана Грушка',
        imageURL: hutirka,
    },
];
